{
  "Home": {
    "welcomeMessage": "ขอต้อนรับสู่โลกส่วนตัวของฉัน — พื้นที่เล็ก ๆ ที่เต็มไปด้วยแรงบันดาลใจ การสร้างสรรค์ และการเดินทางไร้ขีดจำกัดในจักรวาลแห่งเทคโนโลยี"
  },
  "About": {
    "title": "เกี่ยวกับฉัน",
    "description1": "สวัสดีครับ ผมชื่อประเสริฐ นวนนิ่ม\nผมเป็นนักพัฒนาเว็บที่เชี่ยวชาญในการสร้างเว็บแอปพลิเคชันที่มีประสิทธิภาพ ใช้งานง่าย และพร้อมขยายในอนาคต โดยใช้ฟังก์ชันต่าง ๆ ของ Next.js อย่างเต็มรูปแบบ ไม่ว่าจะเป็น Server-side Rendering (SSR), Static Site Generation (SSG), Dynamic Routing, API Routes, Middleware และการจัดการ SEO\n\nผมมีความถนัดในการใช้ TypeScript เพื่อเพิ่มความปลอดภัยของโค้ด, Redux สำหรับการจัดการ state ที่ซับซ้อน และ Tailwind CSS เพื่อออกแบบ UI ที่สวยงามและตอบสนองเร็ว\n\nนอกจากนี้ยังมีประสบการณ์ในการเชื่อมต่อกับฐานข้อมูลทั้ง SQL (เช่น MySQL, PostgreSQL) รวมถึงใช้ Node.js สำหรับพัฒนา API และระบบหลังบ้านที่มีประสิทธิภาพ",
    "description2": "การเดินทางของผมเริ่มต้นจากประสบการณ์กว่า 10 ปีในสายงาน IT Support ซึ่งทำให้ผมได้พัฒนาทักษะในการจัดการระบบ การแก้ปัญหาเชิงเทคนิค และการคิดเชิงระบบอย่างมีประสิทธิภาพ\n\nประสบการณ์เหล่านี้ได้หล่อหลอมแนวคิดในการเป็นนักพัฒนาซอฟต์แวร์ของผมให้เข้าใจทั้งระบบเบื้องหลังและมุมมองของผู้ใช้งานอย่างลึกซึ้ง ผมให้ความสำคัญกับการสร้างโซลูชันที่ใช้งานง่าย และสามารถปรับขยายได้ในระยะยาว\n\nตลอดเส้นทางในสายพัฒนาเว็บ ผมมีโอกาสได้ร่วมพัฒนาโปรเจกต์ที่เกี่ยวข้องกับ IoT และ AI image processing ซึ่งช่วยเสริมประสบการณ์ของผมให้ครอบคลุมตั้งแต่การเชื่อมต่อกับอุปกรณ์จริง การจัดการข้อมูล ไปจนถึงการแสดงผลข้อมูลผ่านเว็บแอปพลิเคชันแบบมีปฏิสัมพันธ์กับผู้ใช้"
  },
  "Skills": {
    "title": "ทักษะของฉัน"
  },
  "Projects": {
    "title": "โปรเจกต์ของฉัน",
"descriptionOEE": "พัฒนาเว็บแอปพลิเคชันเพื่อแสดงข้อมูลจาก แดชบอร์ด OEE ในระบบ IoT โดยมีข้อมูลสำคัญ เช่น ชั่วโมงการทำงาน ชั่วโมงสูญเสีย ผลผลิต และสรุปการสูญเสีย ใช้เทคโนโลยี React (TSX), Chart.js, Material UI และ Redux ในการสร้างแดชบอร์ดแบบ Interactive\n\nสร้างระบบฝั่ง Backend ด้วย Node.js และเชื่อมต่อกับฐานข้อมูล MySQL โดยใช้ Stored Procedure เพื่อช่วยให้การดึงข้อมูลจากตารางต่าง ๆ มีประสิทธิภาพมากขึ้น"
  },
  "workExperience": {
    "title": "ประสบการณ์การทำงาน",
    "descriptionBelton": "ผมเริ่มต้นทำงานที่บริษัท เบลตัน จำกัด ตั้งแต่ปี 2556 - 2567 ในตำแหน่งเจ้าหน้าที่ IT Support โดยรับผิดชอบด้านการติดตั้ง ดูแล และแก้ไขปัญหาคอมพิวเตอร์ทั้งในสำนักงานและพื้นที่การผลิต รวมถึงการแก้ปัญหาเครือข่ายภายในองค์กรที่ใช้ระบบ Cisco ตลอดระยะเวลากว่า 10 ปี ผมได้พัฒนาทักษะทั้งด้านเทคนิคและการคิดเชิงระบบ จนมีโอกาสขยายบทบาทเข้าสู่การพัฒนาเว็บและระบบ IoT โดยได้ออกแบบระบบเครือข่าย Wi-Fi และโดเมน API ภายในเพื่อสนับสนุนโครงการ IoT ใช้ MySQL คำนวณประสิทธิภาพเครื่องจักร (OEE) และเก็บข้อมูลดิบเพื่อการตรวจสอบย้อนหลัง รวมถึงพัฒนาไมโครคอนโทรลเลอร์ด้วยภาษา Python และ Arduino (C/C++) สำหรับการควบคุมอุปกรณ์และเก็บข้อมูลแบบเรียลไทม์ นอกจากนี้ผมยังได้สร้างแดชบอร์ดและเว็บแอปพลิเคชันภายในองค์กรโดยใช้เทคโนโลยีอย่าง Node.js, Next.js, React, Redux, Tailwind CSS และ Chart.js เพื่อแสดงผลข้อมูลจากระบบ IoT และสนับสนุนการตัดสินใจของทีมงานในภาคการผลิต",
     "descriptionGeno":"พัฒนาเว็บแอปพลิเคชันแบบ Full Stack โดยใช้ Next.js ในฝั่ง Frontend และ Node.js ในฝั่ง Backend โดยมี PostgreSQL เป็นฐานข้อมูลหลัก เชื่อมต่อระบบกับอุปกรณ์ IoT เพื่อรับ-ส่งข้อมูลจากคอนโทรลเลอร์ และแสดงผลข้อมูลแบบเรียลไทม์ผ่านแดชบอร์ด พร้อมประสานงานร่วมกับทีมงานหลายฝ่ายเพื่อส่งมอบโซลูชันที่มีประสิทธิภาพและสามารถขยายได้ในอนาคต"
  }
}
