{
  "Home": {
    "welcomeMessage": "ขอต้อนรับสู่โลกส่วนตัวของฉัน — พื้นที่เล็ก ๆ ที่เต็มไปด้วยแรงบันดาลใจ การสร้างสรรค์ และการเดินทางไร้ขีดจำกัดในจักรวาลแห่งเทคโนโลยี"
  },
  "About": {
    "title": "เกี่ยวกับฉัน",
    "description1": "สวัสดีครับ ผมชื่อประเสริฐ นวนนิ่ม\nผมเป็นนักพัฒนาเว็บที่เชี่ยวชาญในการสร้างเว็บแอปพลิเคชันที่มีประสิทธิภาพ ใช้งานง่าย และพร้อมขยายในอนาคต โดยใช้ฟังก์ชันต่าง ๆ ของ Next.js อย่างเต็มรูปแบบ ไม่ว่าจะเป็น Server-side Rendering (SSR), Static Site Generation (SSG), Dynamic Routing, API Routes, Middleware และการจัดการ SEO\n\nผมมีความถนัดในการใช้ TypeScript เพื่อเพิ่มความปลอดภัยของโค้ด, Redux สำหรับการจัดการ state ที่ซับซ้อน และ Tailwind CSS เพื่อออกแบบ UI ที่สวยงามและตอบสนองเร็ว\n\nนอกจากนี้ยังมีประสบการณ์ในการเชื่อมต่อกับฐานข้อมูลทั้ง SQL (เช่น MySQL, PostgreSQL) รวมถึงใช้ Node.js สำหรับพัฒนา API และระบบหลังบ้านที่มีประสิทธิภาพ",
    "description2": "การเดินทางของผมเริ่มต้นจากประสบการณ์กว่า 10 ปีในสายงาน IT Support ซึ่งทำให้ผมได้พัฒนาทักษะในการจัดการระบบ การแก้ปัญหาเชิงเทคนิค และการคิดเชิงระบบอย่างมีประสิทธิภาพ\n\nประสบการณ์เหล่านี้ได้หล่อหลอมแนวคิดในการเป็นนักพัฒนาซอฟต์แวร์ของผมให้เข้าใจทั้งระบบเบื้องหลังและมุมมองของผู้ใช้งานอย่างลึกซึ้ง ผมให้ความสำคัญกับการสร้างโซลูชันที่ใช้งานง่าย และสามารถปรับขยายได้ในระยะยาว\n\nตลอดเส้นทางในสายพัฒนาเว็บ ผมมีโอกาสได้ร่วมพัฒนาโปรเจกต์ที่เกี่ยวข้องกับ IoT และ AI image processing ซึ่งช่วยเสริมประสบการณ์ของผมให้ครอบคลุมตั้งแต่การเชื่อมต่อกับอุปกรณ์จริง การจัดการข้อมูล ไปจนถึงการแสดงผลข้อมูลผ่านเว็บแอปพลิเคชันแบบมีปฏิสัมพันธ์กับผู้ใช้"
  },
  "Skills": {
    "title": "ทักษะของฉัน"
  },
  "Projects": {
    "title": "โปรเจกต์ของฉัน",
    "workProjects": "โปรเจกต์ที่ทำงาน",
    "pocProjects": "โปรเจกต์ทดลอง",
    "descriptionOEE": "พัฒนาเว็บแอปพลิเคชันเพื่อแสดงข้อมูลจาก แดชบอร์ด OEE ในระบบ IoT โดยมีข้อมูลสำคัญ เช่น ชั่วโมงการทำงาน ชั่วโมงสูญเสีย ผลผลิต และสรุปการสูญเสีย ใช้เทคโนโลยี React (TSX), Chart.js, Material UI และ Redux ในการสร้างแดชบอร์ดแบบ Interactive\n\nสร้างระบบฝั่ง Backend ด้วย Node.js และเชื่อมต่อกับฐานข้อมูล MySQL โดยใช้ Stored Procedure เพื่อช่วยให้การดึงข้อมูลจากตารางต่าง ๆ มีประสิทธิภาพมากขึ้น",
    "descriptionMonitorMachine": "พัฒนาเว็บแอปพลิเคชันแบบ Full Stack สำหรับอัปเดตข้อมูลและติดตามสถานะเครื่องจักรแบบเรียลไทม์ โดยเชื่อมต่อระบบ IoT เข้ากับฝั่งผู้ใช้ผ่าน Redux Toolkit, Tailwind CSS, Next.js, NextAuth และ NextUI พร้อมพัฒนา Backend ด้วย Node.js และฐานข้อมูล MySQL ซึ่งระบบนี้รองรับการเข้าสู่ระบบของผู้ใช้ที่ได้รับสิทธิ์ในการแก้ไขสถานะหรือข้อมูลของเครื่องจักร และเปิดให้ผู้ดูแลระบบสามารถจัดการบัญชีผู้ใช้ เช่น การสร้าง แก้ไข ลบ กำหนดสิทธิ์ และรีเซ็ตรหัสผ่านผ่านตารางข้อมูลส่วนกลาง ขณะที่ผู้ใช้ทั่วไปสามารถเข้าถึงและอัปเดตข้อมูลของเครื่องจักรได้ตามสิทธิ์ที่ได้รับ\n",
    "descriptionESD": "พัฒนาระบบ Anti-Static ESD Access Control Tester สำหรับใช้งานร่วมกับฮาร์ดแวร์รุ่นเก่า โดยใช้ไมโครคอนโทรลเลอร์ในการตรวจสอบสถานะพนักงาน ควบคุมการเปิด-ปิดประตู และบันทึกข้อมูลลงฐานข้อมูล MySQL โดยมีการพัฒนา Frontend ด้วย Next.js, Redux Toolkit, Tailwind CSS และ NextAuth และ Backend ด้วย Node.js ขณะเดียวกัน Raspberry Pi ทำงานด้วยสคริปต์ภาษา Python เพื่อสื่อสารกับเครื่องทดสอบ ESD ระบบประกอบด้วยตารางข้อมูลที่สามารถเพิ่ม แก้ไข ลบ และแสดงข้อมูลพนักงาน และหน้าจอ ESD Tester ที่ให้พนักงานระบุรหัสพนักงาน ตรวจสอบสิทธิ์การเข้าถึงไลน์ผลิต และนับจุดสัญญาณเพื่อตรวจสอบค่าที่ได้จากเครื่อง ESD ก่อนส่งผลกลับไปยังระบบ BD\n",
     "descriptionNextAuth": "ทดลองพัฒนาระบบยืนยันตัวตนใน Next.js โดยใช้ NextAuth ผสานกับฐานข้อมูล PostgreSQL รองรับการลงทะเบียนผู้ใช้ การเข้าสู่ระบบ การจัดการเซสชัน และสิทธิ์การเข้าถึงตามบทบาท (RBAC) โดยพัฒนาแบบ SSR ด้วย Next.js และ Tailwind CSS ใช้ Prisma เชื่อมต่อกับฐานข้อมูล PostgreSQL และจัดเก็บข้อมูลแบบโลคอลในไฟล์ .sqlite สำหรับการทดลองในเครื่อง",
     "descriptionBluePrintStatus": "ร่วมพัฒนาเว็บแอปพลิเคชันสำหรับบริหารจัดการสถานะของ BluePrint โดยใช้เทคโนโลยี Next.js และ Material UI (MUI) พร้อมทั้งออกแบบแผนผังด้วย Adobe Illustrator ก่อนนำมาดัดแปลงเป็น React Component เพื่อแสดงผลและควบคุมสถานะต่าง ๆ บน BluePrint ได้อย่างมีประสิทธิภาพ",
     "descriptionScada": "การทดลองพัฒนาเว็บแอปพลิเคชันสำหรับจำลองระบบควบคุมพัดลม วาล์ว และถังเก็บน้ำ โดยใช้ React และ SVG เพื่อแสดงการไหลของอากาศหรือน้ำตามการควบคุมของผู้ใช้แบบอินเทอร์แอคทีฟ รองรับการเปิด–ปิดวาล์ว การปรับความเร็วพัดลม และการแสดงระดับน้ำในถัง แบบจำลองทั้งหมดได้รับการออกแบบด้วย Adobe Illustrator และแปลงเป็น React Component โดยใช้ Next.js สำหรับการแสดงผลบนฝั่งไคลเอนต์"
  },
  "workExperience": {
    "title": "ประสบการณ์การทำงาน",
    "descriptionBelton": "ผมเริ่มต้นทำงานที่บริษัท เบลตัน จำกัด ตั้งแต่ปี 2556 - 2567 ในตำแหน่งเจ้าหน้าที่ IT Support โดยรับผิดชอบด้านการติดตั้ง ดูแล และแก้ไขปัญหาคอมพิวเตอร์ทั้งในสำนักงานและพื้นที่การผลิต รวมถึงการแก้ปัญหาเครือข่ายภายในองค์กรที่ใช้ระบบ Cisco ตลอดระยะเวลากว่า 10 ปี ผมได้พัฒนาทักษะทั้งด้านเทคนิคและการคิดเชิงระบบ จนมีโอกาสขยายบทบาทเข้าสู่การพัฒนาเว็บและระบบ IoT โดยได้ออกแบบระบบเครือข่าย Wi-Fi และโดเมน API ภายในเพื่อสนับสนุนโครงการ IoT ใช้ MySQL คำนวณประสิทธิภาพเครื่องจักร (OEE) และเก็บข้อมูลดิบเพื่อการตรวจสอบย้อนหลัง รวมถึงพัฒนาไมโครคอนโทรลเลอร์ด้วยภาษา Python และ Arduino (C/C++) สำหรับการควบคุมอุปกรณ์และเก็บข้อมูลแบบเรียลไทม์ นอกจากนี้ผมยังได้สร้างแดชบอร์ดและเว็บแอปพลิเคชันภายในองค์กรโดยใช้เทคโนโลยีอย่าง Node.js, Next.js, React, Redux, Tailwind CSS และ Chart.js เพื่อแสดงผลข้อมูลจากระบบ IoT และสนับสนุนการตัดสินใจของทีมงานในภาคการผลิต",
    "descriptionGeno": "พัฒนาเว็บแอปพลิเคชันแบบ Full Stack โดยใช้ Next.js ในฝั่ง Frontend และ Node.js ในฝั่ง Backend โดยมี PostgreSQL เป็นฐานข้อมูลหลัก เชื่อมต่อระบบกับอุปกรณ์ IoT เพื่อรับ-ส่งข้อมูลจากคอนโทรลเลอร์ และแสดงผลข้อมูลแบบเรียลไทม์ผ่านแดชบอร์ด พร้อมประสานงานร่วมกับทีมงานหลายฝ่ายเพื่อส่งมอบโซลูชันที่มีประสิทธิภาพและสามารถขยายได้ในอนาคต"
  },
  "contact": {
    "title": "ติดต่อฉัน",
    "description": "หากคุณสนใจที่จะพูดคุยเกี่ยวกับโปรเจกต์ใหม่ ๆ หรือมีคำถามเกี่ยวกับทักษะและประสบการณ์ของผม สามารถติดต่อผมได้ที่อีเมลหรือโซเชียลมีเดียด้านล่างนี้"
  }
}
